---
kind: type
id: T:Autodesk.Revit.DB.ExportPatternInfo
source: html/17621c1b-5f57-2a25-6ff9-73dfc67d5024.htm
---
# Autodesk.Revit.DB.ExportPatternInfo

A value used to represent the info stored in the ExportPatternTable .

## Syntax (C#)
```csharp
public class ExportPatternInfo : IDisposable
```